#+title: HHCRSP implementado utilizando /Simulated Annealing/
#+author: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+infojs_opt:
#+property: cache yes

Como trabalho final da disciplina de Otimização Combinatória, implementaremos o
problema /The home health care routing and scheduling problem with
interdependent services/ utilizando ambos /solver/ matemático e a
meta-heurística /Simulated Annealing/!

** Estrutura do Projeto

Segue a estrutura básica do projeto, comentada:

#+begin_src bash :exports results :results output
tree -nd
#+end_src

#+RESULTS:
#+begin_example
.                             # root do projeto
├── build                     # pasta de build, caso seja utilizada a opção de make
├── instances                 # pasta de dados, que guarda as instâncias
├── labbook                   # pasta para o lab-book, guardando infos sobre os experimentos
├── report                    # pasta para o relatório
└── src                       # pasta para fontes, nela fica o script principal
    ├── MathSolver            # módulo do solver matemático
    ├── SimulatedAnnealing    # módulo da heurística simulated annealing
    └── Utils                 # módulo para utilidades diversas

8 directories
#+end_example

